sirawit-suk/MicroCon-STM32-Lab/Lab02/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define switch_peripheral_Pin GPIO_PIN_13
#define switch_peripheral_GPIO_Port GPIOC
#define switch_onboard_Pin GPIO_PIN_0
#define switch_onboard_GPIO_Port GPIOA
#define LD8_Pin GPIO_PIN_13
#define LD8_GPIO_Port GPIOF
#define LD7_Pin GPIO_PIN_15
#define LD7_GPIO_Port GPIOF
#define LD6_Pin GPIO_PIN_1
#define LD6_GPIO_Port GPIOG
#define LD5_Pin GPIO_PIN_8
#define LD5_GPIO_Port GPIOE
#define LD4_Pin GPIO_PIN_10
#define LD4_GPIO_Port GPIOE
#define LD3_Pin GPIO_PIN_12
#define LD3_GPIO_Port GPIOE
#define LD2_Pin GPIO_PIN_14
#define LD2_GPIO_Port GPIOE
#define LD1_Pin GPIO_PIN_10
#define LD1_GPIO_Port GPIOB
#define LED1_peripheral_Pin GPIO_PIN_8
#define LED1_peripheral_GPIO_Port GPIOC
#define TESTINPUT_Pin GPIO_PIN_12
#define TESTINPUT_GPIO_Port GPIOC
#define LED1_onboard_Pin GPIO_PIN_13
#define LED1_onboard_GPIO_Port GPIOG
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
